#map = affine_map<(d0) -> (d0)>
#map1 = affine_map<(d0, d1, d2, d3) -> (0, d1, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d1, 0, 0)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
#map4 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d2, d3)>
#map5 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d4, d5)>
#map6 = affine_map<(d0, d1, d2, d3) -> (d0, d1, 0, 0)>
#map7 = affine_map<(d0, d1, d2, d3) -> (0, d1, 0, 0)>
#map8 = affine_map<(d0, d1) -> (d0, d1)>
#map9 = affine_map<(d0, d1) -> (d1, d0)>
#map10 = affine_map<(d0, d1) -> (d1)>
#map11 = affine_map<(d0, d1) -> (0, d1)>
module attributes {torch.debug_module_name = "GraphModule"} {
  ml_program.global private mutable @global_seed(dense<0> : tensor<i64>) : tensor<i64>
  func.func @forward(%arg0: tensor<1x3x224x224xf32>, %arg1: tensor<64x3x7x7xf32>, %arg2: tensor<64xf32>, %arg3: tensor<64xf32>, %arg4: tensor<64xf32>, %arg5: tensor<64xf32>, %arg6: tensor<64x64x1x1xf32>, %arg7: tensor<64xf32>, %arg8: tensor<64xf32>, %arg9: tensor<64xf32>, %arg10: tensor<64xf32>, %arg11: tensor<64x64x3x3xf32>, %arg12: tensor<64xf32>, %arg13: tensor<64xf32>, %arg14: tensor<64xf32>, %arg15: tensor<64xf32>, %arg16: tensor<256x64x1x1xf32>, %arg17: tensor<256xf32>, %arg18: tensor<256xf32>, %arg19: tensor<256xf32>, %arg20: tensor<256xf32>, %arg21: tensor<256x64x1x1xf32>, %arg22: tensor<256xf32>, %arg23: tensor<256xf32>, %arg24: tensor<256xf32>, %arg25: tensor<256xf32>, %arg26: tensor<64x256x1x1xf32>, %arg27: tensor<64xf32>, %arg28: tensor<64xf32>, %arg29: tensor<64xf32>, %arg30: tensor<64xf32>, %arg31: tensor<64x64x3x3xf32>, %arg32: tensor<64xf32>, %arg33: tensor<64xf32>, %arg34: tensor<64xf32>, %arg35: tensor<64xf32>, %arg36: tensor<256x64x1x1xf32>, %arg37: tensor<256xf32>, %arg38: tensor<256xf32>, %arg39: tensor<256xf32>, %arg40: tensor<256xf32>, %arg41: tensor<64x256x1x1xf32>, %arg42: tensor<64xf32>, %arg43: tensor<64xf32>, %arg44: tensor<64xf32>, %arg45: tensor<64xf32>, %arg46: tensor<64x64x3x3xf32>, %arg47: tensor<64xf32>, %arg48: tensor<64xf32>, %arg49: tensor<64xf32>, %arg50: tensor<64xf32>, %arg51: tensor<256x64x1x1xf32>, %arg52: tensor<256xf32>, %arg53: tensor<256xf32>, %arg54: tensor<256xf32>, %arg55: tensor<256xf32>, %arg56: tensor<128x256x1x1xf32>, %arg57: tensor<128xf32>, %arg58: tensor<128xf32>, %arg59: tensor<128xf32>, %arg60: tensor<128xf32>, %arg61: tensor<128x128x3x3xf32>, %arg62: tensor<128xf32>, %arg63: tensor<128xf32>, %arg64: tensor<128xf32>, %arg65: tensor<128xf32>, %arg66: tensor<512x128x1x1xf32>, %arg67: tensor<512xf32>, %arg68: tensor<512xf32>, %arg69: tensor<512xf32>, %arg70: tensor<512xf32>, %arg71: tensor<512x256x1x1xf32>, %arg72: tensor<512xf32>, %arg73: tensor<512xf32>, %arg74: tensor<512xf32>, %arg75: tensor<512xf32>, %arg76: tensor<128x512x1x1xf32>, %arg77: tensor<128xf32>, %arg78: tensor<128xf32>, %arg79: tensor<128xf32>, %arg80: tensor<128xf32>, %arg81: tensor<128x128x3x3xf32>, %arg82: tensor<128xf32>, %arg83: tensor<128xf32>, %arg84: tensor<128xf32>, %arg85: tensor<128xf32>, %arg86: tensor<512x128x1x1xf32>, %arg87: tensor<512xf32>, %arg88: tensor<512xf32>, %arg89: tensor<512xf32>, %arg90: tensor<512xf32>, %arg91: tensor<128x512x1x1xf32>, %arg92: tensor<128xf32>, %arg93: tensor<128xf32>, %arg94: tensor<128xf32>, %arg95: tensor<128xf32>, %arg96: tensor<128x128x3x3xf32>, %arg97: tensor<128xf32>, %arg98: tensor<128xf32>, %arg99: tensor<128xf32>, %arg100: tensor<128xf32>, %arg101: tensor<512x128x1x1xf32>, %arg102: tensor<512xf32>, %arg103: tensor<512xf32>, %arg104: tensor<512xf32>, %arg105: tensor<512xf32>, %arg106: tensor<128x512x1x1xf32>, %arg107: tensor<128xf32>, %arg108: tensor<128xf32>, %arg109: tensor<128xf32>, %arg110: tensor<128xf32>, %arg111: tensor<128x128x3x3xf32>, %arg112: tensor<128xf32>, %arg113: tensor<128xf32>, %arg114: tensor<128xf32>, %arg115: tensor<128xf32>, %arg116: tensor<512x128x1x1xf32>, %arg117: tensor<512xf32>, %arg118: tensor<512xf32>, %arg119: tensor<512xf32>, %arg120: tensor<512xf32>, %arg121: tensor<256x512x1x1xf32>, %arg122: tensor<256xf32>, %arg123: tensor<256xf32>, %arg124: tensor<256xf32>, %arg125: tensor<256xf32>, %arg126: tensor<256x256x3x3xf32>, %arg127: tensor<256xf32>, %arg128: tensor<256xf32>, %arg129: tensor<256xf32>, %arg130: tensor<256xf32>, %arg131: tensor<1024x256x1x1xf32>, %arg132: tensor<1024xf32>, %arg133: tensor<1024xf32>, %arg134: tensor<1024xf32>, %arg135: tensor<1024xf32>, %arg136: tensor<1024x512x1x1xf32>, %arg137: tensor<1024xf32>, %arg138: tensor<1024xf32>, %arg139: tensor<1024xf32>, %arg140: tensor<1024xf32>, %arg141: tensor<256x1024x1x1xf32>, %arg142: tensor<256xf32>, %arg143: tensor<256xf32>, %arg144: tensor<256xf32>, %arg145: tensor<256xf32>, %arg146: tensor<256x256x3x3xf32>, %arg147: tensor<256xf32>, %arg148: tensor<256xf32>, %arg149: tensor<256xf32>, %arg150: tensor<256xf32>, %arg151: tensor<1024x256x1x1xf32>, %arg152: tensor<1024xf32>, %arg153: tensor<1024xf32>, %arg154: tensor<1024xf32>, %arg155: tensor<1024xf32>, %arg156: tensor<256x1024x1x1xf32>, %arg157: tensor<256xf32>, %arg158: tensor<256xf32>, %arg159: tensor<256xf32>, %arg160: tensor<256xf32>, %arg161: tensor<256x256x3x3xf32>, %arg162: tensor<256xf32>, %arg163: tensor<256xf32>, %arg164: tensor<256xf32>, %arg165: tensor<256xf32>, %arg166: tensor<1024x256x1x1xf32>, %arg167: tensor<1024xf32>, %arg168: tensor<1024xf32>, %arg169: tensor<1024xf32>, %arg170: tensor<1024xf32>, %arg171: tensor<256x1024x1x1xf32>, %arg172: tensor<256xf32>, %arg173: tensor<256xf32>, %arg174: tensor<256xf32>, %arg175: tensor<256xf32>, %arg176: tensor<256x256x3x3xf32>, %arg177: tensor<256xf32>, %arg178: tensor<256xf32>, %arg179: tensor<256xf32>, %arg180: tensor<256xf32>, %arg181: tensor<1024x256x1x1xf32>, %arg182: tensor<1024xf32>, %arg183: tensor<1024xf32>, %arg184: tensor<1024xf32>, %arg185: tensor<1024xf32>, %arg186: tensor<256x1024x1x1xf32>, %arg187: tensor<256xf32>, %arg188: tensor<256xf32>, %arg189: tensor<256xf32>, %arg190: tensor<256xf32>, %arg191: tensor<256x256x3x3xf32>, %arg192: tensor<256xf32>, %arg193: tensor<256xf32>, %arg194: tensor<256xf32>, %arg195: tensor<256xf32>, %arg196: tensor<1024x256x1x1xf32>, %arg197: tensor<1024xf32>, %arg198: tensor<1024xf32>, %arg199: tensor<1024xf32>, %arg200: tensor<1024xf32>, %arg201: tensor<256x1024x1x1xf32>, %arg202: tensor<256xf32>, %arg203: tensor<256xf32>, %arg204: tensor<256xf32>, %arg205: tensor<256xf32>, %arg206: tensor<256x256x3x3xf32>, %arg207: tensor<256xf32>, %arg208: tensor<256xf32>, %arg209: tensor<256xf32>, %arg210: tensor<256xf32>, %arg211: tensor<1024x256x1x1xf32>, %arg212: tensor<1024xf32>, %arg213: tensor<1024xf32>, %arg214: tensor<1024xf32>, %arg215: tensor<1024xf32>, %arg216: tensor<512x1024x1x1xf32>, %arg217: tensor<512xf32>, %arg218: tensor<512xf32>, %arg219: tensor<512xf32>, %arg220: tensor<512xf32>, %arg221: tensor<512x512x3x3xf32>, %arg222: tensor<512xf32>, %arg223: tensor<512xf32>, %arg224: tensor<512xf32>, %arg225: tensor<512xf32>, %arg226: tensor<2048x512x1x1xf32>, %arg227: tensor<2048xf32>, %arg228: tensor<2048xf32>, %arg229: tensor<2048xf32>, %arg230: tensor<2048xf32>, %arg231: tensor<2048x1024x1x1xf32>, %arg232: tensor<2048xf32>, %arg233: tensor<2048xf32>, %arg234: tensor<2048xf32>, %arg235: tensor<2048xf32>, %arg236: tensor<512x2048x1x1xf32>, %arg237: tensor<512xf32>, %arg238: tensor<512xf32>, %arg239: tensor<512xf32>, %arg240: tensor<512xf32>, %arg241: tensor<512x512x3x3xf32>, %arg242: tensor<512xf32>, %arg243: tensor<512xf32>, %arg244: tensor<512xf32>, %arg245: tensor<512xf32>, %arg246: tensor<2048x512x1x1xf32>, %arg247: tensor<2048xf32>, %arg248: tensor<2048xf32>, %arg249: tensor<2048xf32>, %arg250: tensor<2048xf32>, %arg251: tensor<512x2048x1x1xf32>, %arg252: tensor<512xf32>, %arg253: tensor<512xf32>, %arg254: tensor<512xf32>, %arg255: tensor<512xf32>, %arg256: tensor<512x512x3x3xf32>, %arg257: tensor<512xf32>, %arg258: tensor<512xf32>, %arg259: tensor<512xf32>, %arg260: tensor<512xf32>, %arg261: tensor<2048x512x1x1xf32>, %arg262: tensor<2048xf32>, %arg263: tensor<2048xf32>, %arg264: tensor<2048xf32>, %arg265: tensor<2048xf32>, %arg266: tensor<1000x2048xf32>, %arg267: tensor<1000xf32>) -> (tensor<1x1000xf32>, tensor<1x256x14x14xf32>, tensor<1x64x56x56xf32>, tensor<512x128x1x1xf32>, tensor<256x1024x1x1xf32>, tensor<512xf32>, tensor<256xf32>, tensor<1x1024x14x14xf32>, tensor<512xf32>, tensor<256xf32>, tensor<512xf32>, tensor<256xf32>, tensor<128x512x1x1xf32>, tensor<256x256x3x3xf32>, tensor<128xf32>, tensor<256xf32>, tensor<128xf32>, tensor<256xf32>, tensor<128xf32>, tensor<256xf32>, tensor<1x256x14x14xf32>, tensor<128x128x3x3xf32>, tensor<1024x256x1x1xf32>, tensor<1x512x28x28xf32>, tensor<128xf32>, tensor<1024xf32>, tensor<128xf32>, tensor<1024xf32>, tensor<128xf32>, tensor<1024xf32>, tensor<1x1024x14x14xf32>, tensor<1x512x28x28xf32>, tensor<512x128x1x1xf32>, tensor<256x1024x1x1xf32>, tensor<512xf32>, tensor<256xf32>, tensor<1x256x14x14xf32>, tensor<512xf32>, tensor<256xf32>, tensor<512xf32>, tensor<256xf32>, tensor<128x512x1x1xf32>, tensor<256x256x3x3xf32>, tensor<128xf32>, tensor<256xf32>, tensor<128xf32>, tensor<256xf32>, tensor<1x1024x14x14xf32>, tensor<128xf32>, tensor<256xf32>, tensor<1x128x56x56xf32>, tensor<128x128x3x3xf32>, tensor<1024x256x1x1xf32>, tensor<128xf32>, tensor<1024xf32>, tensor<1x128x28x28xf32>, tensor<1x128x28x28xf32>, tensor<128xf32>, tensor<1024xf32>, tensor<1x1024x14x14xf32>, tensor<128xf32>, tensor<1024xf32>, tensor<1x256x14x14xf32>, tensor<512x128x1x1xf32>, tensor<256x1024x1x1xf32>, tensor<512xf32>, tensor<256xf32>, tensor<512xf32>, tensor<256xf32>, tensor<1x1024x14x14xf32>, tensor<512xf32>, tensor<256xf32>, tensor<1x128x28x28xf32>, tensor<256x512x1x1xf32>, tensor<256x256x3x3xf32>, tensor<1x1024x14x14xf32>, tensor<1x128x28x28xf32>, tensor<1x256x14x14xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<1x256x28x28xf32>, tensor<1x256x14x14xf32>, tensor<256xf32>, tensor<256xf32>, tensor<1x1024x14x14xf32>, tensor<256x256x3x3xf32>, tensor<1024x256x1x1xf32>, tensor<1024xf32>, tensor<1x512x14x14xf32>, tensor<256xf32>, tensor<256xf32>, tensor<1024xf32>, tensor<256xf32>, tensor<1024xf32>, tensor<1024x256x1x1xf32>, tensor<512x1024x1x1xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1024x512x1x1xf32>, tensor<512x512x3x3xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1x256x14x14xf32>, tensor<1x256x14x14xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<256x1024x1x1xf32>, tensor<2048x512x1x1xf32>, tensor<256xf32>, tensor<2048xf32>, tensor<1x1024x14x14xf32>, tensor<256xf32>, tensor<2048xf32>, tensor<256xf32>, tensor<2048xf32>, tensor<1x256x14x14xf32>, tensor<256x256x3x3xf32>, tensor<2048x1024x1x1xf32>, tensor<1x64x56x56xf32>, tensor<1x256x14x14xf32>, tensor<1x256x14x14xf32>, tensor<256xf32>, tensor<2048xf32>, tensor<256xf32>, tensor<2048xf32>, tensor<256xf32>, tensor<2048xf32>, tensor<1x1024x14x14xf32>, tensor<1024x256x1x1xf32>, tensor<512x2048x1x1xf32>, tensor<1x256x14x14xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1x256x14x14xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1x256x14x14xf32>, tensor<256x1024x1x1xf32>, tensor<512x512x3x3xf32>, tensor<1x512x7x7xf32>, tensor<256xf32>, tensor<512xf32>, tensor<1x128x28x28xf32>, tensor<256xf32>, tensor<512xf32>, tensor<1x128x28x28xf32>, tensor<1x256x14x14xf32>, tensor<256xf32>, tensor<512xf32>, tensor<1x256x14x14xf32>, tensor<1x512x7x7xf32>, tensor<256x256x3x3xf32>, tensor<2048x512x1x1xf32>, tensor<1x256x14x14xf32>, tensor<1x2048xf32>, tensor<256xf32>, tensor<2048xf32>, tensor<256xf32>, tensor<2048xf32>, tensor<256xf32>, tensor<2048xf32>, tensor<1x256x14x14xf32>, tensor<1x512x28x28xf32>, tensor<1x256x56x56xf32>, tensor<1024x256x1x1xf32>, tensor<512x2048x1x1xf32>, tensor<1x512x28x28xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<1x1024x14x14xf32>, tensor<1024xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<1x128x56x56xf32>, tensor<1x3x224x224xf32>, tensor<512xf32>, tensor<64x3x7x7xf32>, tensor<512xf32>, tensor<1x256x14x14xf32>, tensor<64xf32>, tensor<1x2048x7x7xf32>, tensor<512xf32>, tensor<64xf32>, tensor<64xf32>, tensor<2048x512x1x1xf32>, tensor<2048xf32>, tensor<64x64x1x1xf32>, tensor<1x512x7x7xf32>, tensor<2048xf32>, tensor<64xf32>, tensor<2048xf32>, tensor<64xf32>, tensor<64xf32>, tensor<1x2048x7x7xf32>, tensor<64x64x3x3xf32>, tensor<1x256x56x56xf32>, tensor<1x256x56x56xf32>, tensor<1x2048x7x7xf32>, tensor<2048x1000xf32>, tensor<64xf32>, tensor<1x128x28x28xf32>, tensor<64xf32>, tensor<64xf32>, tensor<1x128x28x28xf32>, tensor<256x64x1x1xf32>, tensor<256xf32>, tensor<1x128x28x28xf32>, tensor<256xf32>, tensor<1x64x56x56xi64>, tensor<256xf32>, tensor<1x64x56x56xf32>, tensor<256x64x1x1xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<1x64x56x56xf32>, tensor<64x256x1x1xf32>, tensor<64xf32>, tensor<1x2048x7x7xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>, tensor<64xf32>, tensor<1x512x7x7xf32>, tensor<64xf32>, tensor<1x64x56x56xf32>, tensor<256x64x1x1xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<1x128x28x28xf32>, tensor<1x64x56x56xf32>, tensor<1x128x28x28xf32>, tensor<64x256x1x1xf32>, tensor<1x2048x7x7xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<1x256x56x56xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>, tensor<1x512x28x28xf32>, tensor<64xf32>, tensor<1x512x28x28xf32>, tensor<64xf32>, tensor<1x256x14x14xf32>, tensor<256x64x1x1xf32>, tensor<1x512x7x7xf32>, tensor<256xf32>, tensor<1x128x28x28xf32>, tensor<1x512x28x28xf32>, tensor<256xf32>, tensor<1x64x112x112xf32>, tensor<1x1024x14x14xf32>, tensor<256xf32>, tensor<1x512x7x7xf32>, tensor<128x256x1x1xf32>, tensor<1x256x56x56xf32>, tensor<128xf32>, tensor<1x64x112x112xf32>, tensor<128xf32>, tensor<1x256x56x56xf32>, tensor<1x64x56x56xf32>, tensor<128xf32>, tensor<1x64x56x56xf32>, tensor<1x128x28x28xf32>, tensor<1x256x56x56xf32>, tensor<1x1024x14x14xf32>, tensor<128x128x3x3xf32>, tensor<1x256x14x14xf32>, tensor<1x512x7x7xf32>, tensor<128xf32>, tensor<1x64x56x56xf32>, tensor<128xf32>, tensor<128xf32>, tensor<1x64x56x56xf32>, tensor<512x128x1x1xf32>, tensor<1x64x56x56xf32>, tensor<1x512x7x7xf32>, tensor<512xf32>, tensor<1x256x28x28xf32>, tensor<1x64x56x56xf32>, tensor<512xf32>, tensor<1x64x56x56xf32>, tensor<512x256x1x1xf32>, tensor<1x256x14x14xf32>, tensor<512xf32>, tensor<1x512x14x14xf32>, tensor<512xf32>, tensor<512xf32>, tensor<1x2048x7x7xf32>, tensor<512xf32>, tensor<1x2048x7x7xf32>, tensor<128x512x1x1xf32>, tensor<1x512x28x28xf32>, tensor<1x1024x14x14xf32>, tensor<128xf32>, tensor<1x512x7x7xf32>, tensor<128xf32>, tensor<1x512x28x28xf32>, tensor<128xf32>, tensor<1x128x28x28xf32>, tensor<1x512x7x7xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>) {
    %c-1_i64 = arith.constant -1 : i64
    %c2 = arith.constant 2 : index
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant 1.000000e+00 : f32
    %cst_1 = arith.constant -3.40282347E+38 : f32
    %cst_2 = arith.constant 1.000000e-05 : f64
    %c112 = arith.constant 112 : index
    %c3 = arith.constant 3 : index
    %c1 = arith.constant 1 : index
    %c0 = arith.constant 0 : index
    %cst_3 = arith.constant 4.900000e+01 : f32
    %padded = tensor.pad %arg0 low[0, 0, 3, 3] high[0, 0, 3, 3] {
    ^bb0(%arg268: index, %arg269: index, %arg270: index, %arg271: index):
      tensor.yield %cst : f32
    } : tensor<1x3x224x224xf32> to tensor<1x3x230x230xf32>
    %0 = tensor.empty() : tensor<1x64x112x112xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<1x64x112x112xf32>) -> tensor<1x64x112x112xf32>
    %2 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<2> : vector<2xi64>} ins(%padded, %arg1 : tensor<1x3x230x230xf32>, tensor<64x3x7x7xf32>) outs(%1 : tensor<1x64x112x112xf32>) -> tensor<1x64x112x112xf32>
    %3 = tensor.empty() : tensor<64xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%arg3 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.truncf %cst_2 : f64 to f32
      %537 = arith.addf %in, %536 : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%4 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = math.sqrt %in : f32
      linalg.yield %536 : f32
    } -> tensor<64xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%5 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf one, %in, %cst : f32
      cf.assert %536, "unimplemented: tensor with zero element"
      %537 = arith.divf %cst_0, %in : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %expanded = tensor.expand_shape %arg2 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_4 = tensor.expand_shape %6 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %7 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%2, %expanded : tensor<1x64x112x112xf32>, tensor<64x1x1xf32>) outs(%0 : tensor<1x64x112x112xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.subf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x112x112xf32>
    %8 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%7, %expanded_4 : tensor<1x64x112x112xf32>, tensor<64x1x1xf32>) outs(%0 : tensor<1x64x112x112xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x112x112xf32>
    %expanded_5 = tensor.expand_shape %arg4 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_6 = tensor.expand_shape %arg5 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %9 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%8, %expanded_5 : tensor<1x64x112x112xf32>, tensor<64x1x1xf32>) outs(%0 : tensor<1x64x112x112xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x112x112xf32>
    %10 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%9, %expanded_6 : tensor<1x64x112x112xf32>, tensor<64x1x1xf32>) outs(%0 : tensor<1x64x112x112xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x112x112xf32>
    %11 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%10 : tensor<1x64x112x112xf32>) outs(%0 : tensor<1x64x112x112xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf ugt, %in, %cst : f32
      %537 = arith.select %536, %in, %cst : f32
      linalg.yield %537 : f32
    } -> tensor<1x64x112x112xf32>
    %padded_7 = tensor.pad %11 low[0, 0, 1, 1] high[0, 0, 1, 1] {
    ^bb0(%arg268: index, %arg269: index, %arg270: index, %arg271: index):
      tensor.yield %cst_1 : f32
    } : tensor<1x64x112x112xf32> to tensor<1x64x114x114xf32>
    %12 = tensor.empty() : tensor<1x64x56x56xf32>
    %13 = linalg.fill ins(%cst_1 : f32) outs(%12 : tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %14 = tensor.empty() : tensor<3x3xf32>
    %15 = linalg.pooling_nchw_max {dilations = dense<1> : vector<2xi64>, strides = dense<2> : vector<2xi64>} ins(%padded_7, %14 : tensor<1x64x114x114xf32>, tensor<3x3xf32>) outs(%13 : tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %16 = tensor.empty() : tensor<1x64x56x56xi64>
    %17 = linalg.fill ins(%c-1_i64 : i64) outs(%16 : tensor<1x64x56x56xi64>) -> tensor<1x64x56x56xi64>
    %18 = tensor.empty() : tensor<3x3xi64>
    %19 = linalg.generic {indexing_maps = [#map4, #map5, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel", "reduction", "reduction"]} ins(%15, %18 : tensor<1x64x56x56xf32>, tensor<3x3xi64>) outs(%17 : tensor<1x64x56x56xi64>) {
    ^bb0(%in: f32, %in_232: i64, %out: i64):
      %536 = linalg.index 0 : index
      %537 = linalg.index 1 : index
      %538 = linalg.index 2 : index
      %539 = linalg.index 3 : index
      %540 = linalg.index 4 : index
      %541 = linalg.index 5 : index
      %542 = arith.muli %538, %c2 : index
      %543 = arith.addi %542, %540 : index
      %544 = arith.muli %539, %c2 : index
      %545 = arith.addi %544, %541 : index
      %extracted = tensor.extract %padded_7[%536, %537, %543, %545] : tensor<1x64x114x114xf32>
      %546 = arith.cmpf oeq, %extracted, %in : f32
      %547 = arith.subi %543, %c1 : index
      %548 = arith.subi %545, %c1 : index
      %549 = arith.muli %547, %c112 : index
      %550 = arith.addi %549, %548 : index
      %551 = arith.index_cast %550 : index to i64
      %552 = arith.select %546, %551, %out : i64
      %553 = arith.cmpi eq, %out, %c-1_i64 : i64
      %554 = arith.select %553, %552, %out : i64
      linalg.yield %554 : i64
    } -> tensor<1x64x56x56xi64>
    %20 = linalg.fill ins(%cst : f32) outs(%12 : tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %21 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%15, %arg6 : tensor<1x64x56x56xf32>, tensor<64x64x1x1xf32>) outs(%20 : tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %22 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%arg8 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.truncf %cst_2 : f64 to f32
      %537 = arith.addf %in, %536 : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %23 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%22 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = math.sqrt %in : f32
      linalg.yield %536 : f32
    } -> tensor<64xf32>
    %24 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%23 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf one, %in, %cst : f32
      cf.assert %536, "unimplemented: tensor with zero element"
      %537 = arith.divf %cst_0, %in : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %expanded_8 = tensor.expand_shape %arg7 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_9 = tensor.expand_shape %24 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %25 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%21, %expanded_8 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.subf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %26 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%25, %expanded_9 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %expanded_10 = tensor.expand_shape %arg9 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_11 = tensor.expand_shape %arg10 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %27 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%26, %expanded_10 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %28 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%27, %expanded_11 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %29 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%28 : tensor<1x64x56x56xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf ugt, %in, %cst : f32
      %537 = arith.select %536, %in, %cst : f32
      linalg.yield %537 : f32
    } -> tensor<1x64x56x56xf32>
    %padded_12 = tensor.pad %29 low[0, 0, 1, 1] high[0, 0, 1, 1] {
    ^bb0(%arg268: index, %arg269: index, %arg270: index, %arg271: index):
      tensor.yield %cst : f32
    } : tensor<1x64x56x56xf32> to tensor<1x64x58x58xf32>
    %30 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%padded_12, %arg11 : tensor<1x64x58x58xf32>, tensor<64x64x3x3xf32>) outs(%20 : tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %31 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%arg13 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.truncf %cst_2 : f64 to f32
      %537 = arith.addf %in, %536 : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %32 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%31 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = math.sqrt %in : f32
      linalg.yield %536 : f32
    } -> tensor<64xf32>
    %33 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%32 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf one, %in, %cst : f32
      cf.assert %536, "unimplemented: tensor with zero element"
      %537 = arith.divf %cst_0, %in : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %expanded_13 = tensor.expand_shape %arg12 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_14 = tensor.expand_shape %33 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %34 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%30, %expanded_13 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.subf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %35 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%34, %expanded_14 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %expanded_15 = tensor.expand_shape %arg14 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_16 = tensor.expand_shape %arg15 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %36 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%35, %expanded_15 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %37 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%36, %expanded_16 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %38 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%37 : tensor<1x64x56x56xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf ugt, %in, %cst : f32
      %537 = arith.select %536, %in, %cst : f32
      linalg.yield %537 : f32
    } -> tensor<1x64x56x56xf32>
    %39 = tensor.empty() : tensor<1x256x56x56xf32>
    %40 = linalg.fill ins(%cst : f32) outs(%39 : tensor<1x256x56x56xf32>) -> tensor<1x256x56x56xf32>
    %41 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%38, %arg16 : tensor<1x64x56x56xf32>, tensor<256x64x1x1xf32>) outs(%40 : tensor<1x256x56x56xf32>) -> tensor<1x256x56x56xf32>
    %42 = tensor.empty() : tensor<256xf32>
    %43 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%arg18 : tensor<256xf32>) outs(%42 : tensor<256xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.truncf %cst_2 : f64 to f32
      %537 = arith.addf %in, %536 : f32
      linalg.yield %537 : f32
    } -> tensor<256xf32>
    %44 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%43 : tensor<256xf32>) outs(%42 : tensor<256xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = math.sqrt %in : f32
      linalg.yield %536 : f32
    } -> tensor<256xf32>
    %45 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%44 : tensor<256xf32>) outs(%42 : tensor<256xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf one, %in, %cst : f32
      cf.assert %536, "unimplemented: tensor with zero element"
      %537 = arith.divf %cst_0, %in : f32
      linalg.yield %537 : f32
    } -> tensor<256xf32>
    %expanded_17 = tensor.expand_shape %arg17 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %expanded_18 = tensor.expand_shape %45 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %46 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%41, %expanded_17 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.subf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %47 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%46, %expanded_18 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %expanded_19 = tensor.expand_shape %arg19 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %expanded_20 = tensor.expand_shape %arg20 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %48 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%47, %expanded_19 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %49 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%48, %expanded_20 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %50 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%15, %arg21 : tensor<1x64x56x56xf32>, tensor<256x64x1x1xf32>) outs(%40 : tensor<1x256x56x56xf32>) -> tensor<1x256x56x56xf32>
    %51 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%arg23 : tensor<256xf32>) outs(%42 : tensor<256xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.truncf %cst_2 : f64 to f32
      %537 = arith.addf %in, %536 : f32
      linalg.yield %537 : f32
    } -> tensor<256xf32>
    %52 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%51 : tensor<256xf32>) outs(%42 : tensor<256xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = math.sqrt %in : f32
      linalg.yield %536 : f32
    } -> tensor<256xf32>
    %53 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%52 : tensor<256xf32>) outs(%42 : tensor<256xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf one, %in, %cst : f32
      cf.assert %536, "unimplemented: tensor with zero element"
      %537 = arith.divf %cst_0, %in : f32
      linalg.yield %537 : f32
    } -> tensor<256xf32>
    %expanded_21 = tensor.expand_shape %arg22 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %expanded_22 = tensor.expand_shape %53 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %54 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%50, %expanded_21 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.subf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %55 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%54, %expanded_22 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %expanded_23 = tensor.expand_shape %arg24 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %expanded_24 = tensor.expand_shape %arg25 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %56 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%55, %expanded_23 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %57 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%56, %expanded_24 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %58 = linalg.generic {indexing_maps = [#map1, #map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%49, %57 : tensor<1x256x56x56xf32>, tensor<1x256x56x56xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %59 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%58 : tensor<1x256x56x56xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf ugt, %in, %cst : f32
      %537 = arith.select %536, %in, %cst : f32
      linalg.yield %537 : f32
    } -> tensor<1x256x56x56xf32>
    %60 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%59, %arg26 : tensor<1x256x56x56xf32>, tensor<64x256x1x1xf32>) outs(%20 : tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %61 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%arg28 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.truncf %cst_2 : f64 to f32
      %537 = arith.addf %in, %536 : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %62 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%61 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = math.sqrt %in : f32
      linalg.yield %536 : f32
    } -> tensor<64xf32>
    %63 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%62 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf one, %in, %cst : f32
      cf.assert %536, "unimplemented: tensor with zero element"
      %537 = arith.divf %cst_0, %in : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %expanded_25 = tensor.expand_shape %arg27 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_26 = tensor.expand_shape %63 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %64 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%60, %expanded_25 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.subf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %65 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%64, %expanded_26 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %expanded_27 = tensor.expand_shape %arg29 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_28 = tensor.expand_shape %arg30 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %66 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%65, %expanded_27 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %67 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%66, %expanded_28 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %68 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%67 : tensor<1x64x56x56xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf ugt, %in, %cst : f32
      %537 = arith.select %536, %in, %cst : f32
      linalg.yield %537 : f32
    } -> tensor<1x64x56x56xf32>
    %padded_29 = tensor.pad %68 low[0, 0, 1, 1] high[0, 0, 1, 1] {
    ^bb0(%arg268: index, %arg269: index, %arg270: index, %arg271: index):
      tensor.yield %cst : f32
    } : tensor<1x64x56x56xf32> to tensor<1x64x58x58xf32>
    %69 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%padded_29, %arg31 : tensor<1x64x58x58xf32>, tensor<64x64x3x3xf32>) outs(%20 : tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %70 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%arg33 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.truncf %cst_2 : f64 to f32
      %537 = arith.addf %in, %536 : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %71 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%70 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = math.sqrt %in : f32
      linalg.yield %536 : f32
    } -> tensor<64xf32>
    %72 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%71 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf one, %in, %cst : f32
      cf.assert %536, "unimplemented: tensor with zero element"
      %537 = arith.divf %cst_0, %in : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %expanded_30 = tensor.expand_shape %arg32 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_31 = tensor.expand_shape %72 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %73 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%69, %expanded_30 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.subf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %74 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%73, %expanded_31 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %expanded_32 = tensor.expand_shape %arg34 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_33 = tensor.expand_shape %arg35 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %75 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%74, %expanded_32 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %76 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%75, %expanded_33 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %77 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%76 : tensor<1x64x56x56xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf ugt, %in, %cst : f32
      %537 = arith.select %536, %in, %cst : f32
      linalg.yield %537 : f32
    } -> tensor<1x64x56x56xf32>
    %78 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%77, %arg36 : tensor<1x64x56x56xf32>, tensor<256x64x1x1xf32>) outs(%40 : tensor<1x256x56x56xf32>) -> tensor<1x256x56x56xf32>
    %79 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%arg38 : tensor<256xf32>) outs(%42 : tensor<256xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.truncf %cst_2 : f64 to f32
      %537 = arith.addf %in, %536 : f32
      linalg.yield %537 : f32
    } -> tensor<256xf32>
    %80 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%79 : tensor<256xf32>) outs(%42 : tensor<256xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = math.sqrt %in : f32
      linalg.yield %536 : f32
    } -> tensor<256xf32>
    %81 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%80 : tensor<256xf32>) outs(%42 : tensor<256xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf one, %in, %cst : f32
      cf.assert %536, "unimplemented: tensor with zero element"
      %537 = arith.divf %cst_0, %in : f32
      linalg.yield %537 : f32
    } -> tensor<256xf32>
    %expanded_34 = tensor.expand_shape %arg37 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %expanded_35 = tensor.expand_shape %81 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %82 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%78, %expanded_34 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.subf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %83 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%82, %expanded_35 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %expanded_36 = tensor.expand_shape %arg39 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %expanded_37 = tensor.expand_shape %arg40 [[0, 1, 2]] : tensor<256xf32> into tensor<256x1x1xf32>
    %84 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%83, %expanded_36 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %85 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%84, %expanded_37 : tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %86 = linalg.generic {indexing_maps = [#map1, #map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%85, %59 : tensor<1x256x56x56xf32>, tensor<1x256x56x56xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.addf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x256x56x56xf32>
    %87 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%86 : tensor<1x256x56x56xf32>) outs(%39 : tensor<1x256x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf ugt, %in, %cst : f32
      %537 = arith.select %536, %in, %cst : f32
      linalg.yield %537 : f32
    } -> tensor<1x256x56x56xf32>
    %88 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%87, %arg41 : tensor<1x256x56x56xf32>, tensor<64x256x1x1xf32>) outs(%20 : tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %89 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%arg43 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.truncf %cst_2 : f64 to f32
      %537 = arith.addf %in, %536 : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %90 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%89 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = math.sqrt %in : f32
      linalg.yield %536 : f32
    } -> tensor<64xf32>
    %91 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%90 : tensor<64xf32>) outs(%3 : tensor<64xf32>) {
    ^bb0(%in: f32, %out: f32):
      %536 = arith.cmpf one, %in, %cst : f32
      cf.assert %536, "unimplemented: tensor with zero element"
      %537 = arith.divf %cst_0, %in : f32
      linalg.yield %537 : f32
    } -> tensor<64xf32>
    %expanded_38 = tensor.expand_shape %arg42 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_39 = tensor.expand_shape %91 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %92 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%88, %expanded_38 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.subf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %93 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%92, %expanded_39 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
    %expanded_40 = tensor.expand_shape %arg44 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %expanded_41 = tensor.expand_shape %arg45 [[0, 1, 2]] : tensor<64xf32> into tensor<64x1x1xf32>
    %94 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%93, %expanded_40 : tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) outs(%12 : tensor<1x64x56x56xf32>) {
    ^bb0(%in: f32, %in_232: f32, %out: f32):
      %536 = arith.mulf %in, %in_232 : f32
      linalg.yield %536 : f32
    } -> tensor<1x64x56x56xf32>
